ob-async.org
#+TITLE: org-babel-async
#+AUTHOR: Andrew Stahlman

* Wishlist
- [X] Add README
- [X] Add package metadata, e.g. author, version, installation
  instructions, etc.
- [ ] Add to MELPA
- [ ] Additional testing: named src blocks, concurrent execution,
  post-processing, etc.
- [ ] Separate make targets for environment setup and running unit
  tests, so that subsequent unit test runs don't require network
  access
- [ ] Proper make target to generate .el from .org source
- [ ] Support #+CALL blocks
- [ ] Write BDD style integration tests, like [[http://rejeep.github.io/emacs/testing/cask/ecukes/2013/10/20/integration-testing-in-emacs.html][this]]
* Proof of Concept

I love org-babel, but I hate that long-running functions (e.g.,
querying Redshift) block Emacs until completion.

I'd like to be able to start a function evaluating and then continue
editing in the same buffer while it executes.

** Phase 1: Async execution, no return

Here's a good start, proving that we can execute source blocks
asynchronously. I just took the existing =org-babel-execute-src-block=
definition and replaced the actual function call with an asynchronous
implementation. From here we just need to capture the results and
insert them into the buffer.

#+BEGIN_SRC emacs-lisp
    (defun org-babel-execute-src-block-mine (&optional arg info params)
      "Execute the current source code block.
    Insert the results of execution into the buffer.  Source code
    execution and the collection and formatting of results can be
    controlled through a variety of header arguments.

    With prefix argument ARG, force re-execution even if an existing
    result cached in the buffer would otherwise have been returned.

    Optionally supply a value for INFO in the form returned by
    `org-babel-get-src-block-info'.

    Optionally supply a value for PARAMS which will be merged with
    the header arguments specified at the front of the source code
    block."
      (interactive)
      (let* ((org-babel-current-src-block-location
	      (or org-babel-current-src-block-location
	          (nth 5 info)
	          (org-babel-where-is-src-block-head)))
	     (info (if info (copy-tree info) (org-babel-get-src-block-info))))
        ;; Merge PARAMS with INFO before considering source block
        ;; evaluation since both could disagree.
        (cl-callf org-babel-merge-params (nth 2 info) params)
        (when (org-babel-check-evaluate info)
          (cl-callf org-babel-process-params (nth 2 info))
          (let* ((params (nth 2 info))
	         (cache (let ((c (cdr (assq :cache params))))
		          (and (not arg) c (string= "yes" c))))
	         (new-hash (and cache (org-babel-sha1-hash info)))
	         (old-hash (and cache (org-babel-current-result-hash)))
	         (current-cache (and new-hash (equal new-hash old-hash))))
	    (cond
	     (current-cache
	      (save-excursion		;Return cached result.
	        (goto-char (org-babel-where-is-src-block-result nil info))
	        (forward-line)
	        (skip-chars-forward " \t")
	        (let ((result (org-babel-read-result)))
	          (message (replace-regexp-in-string "%" "%%" (format "%S" result)))
	          result)))
	     ((org-babel-confirm-evaluate info)
	      (let* ((lang (nth 0 info))
		     (result-params (cdr (assq :result-params params)))
		     ;; Expand noweb references in BODY and remove any
		     ;; coderef.
		     (body
		      (let ((coderef (nth 6 info))
			    (expand
			     (if (org-babel-noweb-p params :eval)
			         (org-babel-expand-noweb-references info)
			       (nth 1 info))))
		        (if (not coderef) expand
		          (replace-regexp-in-string
		           (org-src-coderef-regexp coderef) "" expand nil nil 1))))
		     (dir (cdr (assq :dir params)))
		     (default-directory
		       (or (and dir (file-name-as-directory (expand-file-name dir)))
		           default-directory))
		     (cmd (intern (concat "org-babel-execute:" lang)))
		     result)
	        (unless (fboundp cmd)
	          (error "No org-babel-execute function for %s!" lang))
	        (message "executing %s code block%s..."
		         (capitalize lang)
		         (let ((name (nth 4 info)))
		           (if name (format " (%s)" name) "")))
	        (if (member "none" result-params)
		    (progn (funcall cmd body params)
		           (message "result silenced"))
	          (progn
                    (async-start
                     `(lambda ()
                        (setq exec-path (append exec-path '("~/.emacs.d/elpa")))
                        (package-initialize)
                        (org-babel-do-load-languages
                         'org-babel-load-languages
                         '((emacs-lisp . t)
                           (shell . t)))
                        (,cmd ,body ',params))
                     (lambda (result)
                       (message "Async done: %s" result)))
                    (setq result
                          (let ((r (funcall cmd body params)))
                            (if (and (eq (cdr (assq :result-type params)) 'value)
                                     (or (member "vector" result-params)
                                         (member "table" result-params))
                                     (not (listp r)))
                                (list (list r))
                              r))))
	          (let ((file (cdr (assq :file params))))
		    ;; If non-empty result and :file then write to :file.
		    (when file
		      (when result
		        (with-temp-file file
		          (insert (org-babel-format-result
			           result (cdr (assq :sep params))))))
		      (setq result file))
		    ;; Possibly perform post process provided its
		    ;; appropriate.  Dynamically bind "*this*" to the
		    ;; actual results of the block.
		    (let ((post (cdr (assq :post params))))
		      (when post
		        (let ((*this* (if (not file) result
				        (org-babel-result-to-file
				         file
				         (let ((desc (assq :file-desc params)))
				           (and desc (or (cdr desc) result)))))))
		          (setq result (org-babel-ref-resolve post))
		          (when file
			    (setq result-params (remove "file" result-params))))))
		    (org-babel-insert-result-mine
		     result result-params info new-hash lang)))
	        (run-hooks 'org-babel-after-execute-hook)
	        result)))))))
#+END_SRC

#+RESULTS:
: org-babel-execute-src-block-mine

** Phase 2: Async execution, with return

Spent a while tracking down why org-babel-insert-result was throwing
this error:

#+BEGIN_EXAMPLE
if: Wrong type argument: integer-or-marker-p, nil
#+END_EXAMPLE

Note to self: src_emacs-lisp{(setq async-debug t)} {{{results(=t=)}}} is your friend for
debugging errors like this. You can yank the exact string that's
getting passed to the child process out of the ~*Messages*~ buffer and
debug it in an ~emacs -Q~ session.

Using this method I eventually worked out the right combination of
escapes and captures in the async macros. And it actually works!

#+BEGIN_SRC emacs-lisp
  (defun org-babel-execute-src-block-mine (&optional arg info params)
    "Execute the current source code block.
  Insert the results of execution into the buffer.  Source code
  execution and the collection and formatting of results can be
  controlled through a variety of header arguments.

  With prefix argument ARG, force re-execution even if an existing
  result cached in the buffer would otherwise have been returned.

  Optionally supply a value for INFO in the form returned by
  `org-babel-get-src-block-info'.

  Optionally supply a value for PARAMS which will be merged with
  the header arguments specified at the front of the source code
  block."
    (interactive)
    (let* ((org-babel-current-src-block-location
	    (or org-babel-current-src-block-location
	        (nth 5 info)
	        (org-babel-where-is-src-block-head)))
	   (info (if info (copy-tree info) (org-babel-get-src-block-info))))
      ;; Merge PARAMS with INFO before considering source block
      ;; evaluation since both could disagree.
      (cl-callf org-babel-merge-params (nth 2 info) params)
      (when (org-babel-check-evaluate info)
        (cl-callf org-babel-process-params (nth 2 info))
        (let* ((params (nth 2 info))
	       (cache (let ((c (cdr (assq :cache params))))
		        (and (not arg) c (string= "yes" c))))
	       (new-hash (and cache (org-babel-sha1-hash info)))
	       (old-hash (and cache (org-babel-current-result-hash)))
	       (current-cache (and new-hash (equal new-hash old-hash))))
	  (cond
	   (current-cache
	    (save-excursion		;Return cached result.
	      (goto-char (org-babel-where-is-src-block-result nil info))
	      (forward-line)
	      (skip-chars-forward " \t")
	      (let ((result (org-babel-read-result)))
	        (message (replace-regexp-in-string "%" "%%" (format "%S" result)))
	        result)))
	   ((org-babel-confirm-evaluate info)
	    (let* ((lang (nth 0 info))
		   (result-params (cdr (assq :result-params params)))
		   ;; Expand noweb references in BODY and remove any
		   ;; coderef.
		   (body
		    (let ((coderef (nth 6 info))
			  (expand
			   (if (org-babel-noweb-p params :eval)
			       (org-babel-expand-noweb-references info)
			     (nth 1 info))))
		      (if (not coderef) expand
		        (replace-regexp-in-string
		         (org-src-coderef-regexp coderef) "" expand nil nil 1))))
		   (dir (cdr (assq :dir params)))
		   (default-directory
		     (or (and dir (file-name-as-directory (expand-file-name dir)))
		         default-directory))
		   (cmd (intern (concat "org-babel-execute:" lang)))
		   result)
	      (unless (fboundp cmd)
	        (error "No org-babel-execute function for %s!" lang))
	      (message "executing %s code block%s..."
		       (capitalize lang)
		       (let ((name (nth 4 info)))
		         (if name (format " (%s)" name) "")))
	      (if (member "none" result-params)
		  (progn (funcall cmd body params)
		         (message "result silenced"))
	        (progn
                  (async-start
                   `(lambda ()
                      (setq exec-path (append exec-path '("~/.emacs.d/elpa")))
                      (package-initialize)
                      (org-babel-do-load-languages
                       'org-babel-load-languages
                       '((emacs-lisp . t)
                         (shell . t)))
                      (,cmd ,body ',params))
                   `(lambda (result)
                     (message "Async done: %s" result)
                     (switch-to-buffer ,(current-buffer))
                     (goto-char ,(point))
                     (org-babel-insert-result result)
                     (message "Insert done: %s" result)
                     (run-hooks 'org-babel-after-execute-hook))))))))))))
#+END_SRC
#+RESULTS:
: org-babel-execute-src-block-mine

#+BEGIN_SRC sh
sleep 7s && echo "hi"
#+END_SRC

#+RESULTS:
: hi

Woo-hoo! The problem ended up being that the callback was running in a
buffer called <*emacs*> or some such name, so it wasn't able to find
the #+RESULTS block.

* Header
:PROPERTIES:
:header-args: :tangle ob-async.el
:END:


#+BEGIN_SRC emacs-lisp
  ;;; ob-async.el --- Asynchronous org-babel src block execution

  ;; Copyright (C) 2017 Andrew Stahlman

  ;; Author: Andrew Stahlman <andrewstahlman@gmail.com>
  ;; Created: 10 Feb 2017
  ;; Version: 0.1

  ;; Keywords: tools
  ;; Homepage: https://github.com/astahlman/ob-async

  ;; This file is not part of GNU Emacs.

  ;; This program is free software: you can redistribute it and/or modify
  ;; it under the terms of the GNU General Public License as published by
  ;; the Free Software Foundation, either version 3 of the License, or
  ;; (at your option) any later version.

  ;; This program is distributed in the hope that it will be useful,
  ;; but WITHOUT ANY WARRANTY; without even the implied warranty of
  ;; MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
  ;; GNU General Public License for more details.

  ;; You should have received a copy of the GNU General Public License
  ;; along with this program.  If not, see <http://www.gnu.org/licenses/>.

  ;; Package-Requires: ((async "1.9") (org "9.0.1"))

  ;;; Commentary:
  ;; This file enables asynchronous execution of org-babel
  ;; src blocks through the ob-async-org-babel-execute-src-block function

  ;;; Code:
#+END_SRC

* Implementation
:PROPERTIES:
:header-args: :tangle ob-async.el
:END:

Ok, now that this works, let's think about the right way to do this.
I'm thinking of dispatching based on the presence of an :async src
block header. If that header is present, we'll replace or insert a
GUID placeholder in the results block and then kick off the
asynchronous process. In the callback, we'll switch back to this
buffer, goto point min, search forward for the captured GUID
placeholder, and replace/insert the results.

I'd also like to test this with ERT.

#+BEGIN_SRC emacs-lisp
  (provide 'ob-async)

  (require 'org)
  (require 'async)
#+END_SRC

#+RESULTS:
: ob-async

** Acceptance Tests
:PROPERTIES:
:header-args: :tangle test/ob-async-test.el
:END:

