ob-async.org
** Definition

I didn't follow the standard naming convention when I named this
function the first time around. This alias ensures we don't break
anyone's ctrl-c ctrl-c hooks.

#+BEGIN_SRC emacs-lisp
  ;;;###autoload
  (defalias 'org-babel-execute-src-block:async 'ob-async-org-babel-execute-src-block)
#+END_SRC

If the header contains ~:async~, we'll steal the command before it
gets to ~org-babel-execute-src-block~. The guts of this function are
ripped straight from the original source for
~org-babel-execute-src-block~.

#+BEGIN_SRC emacs-lisp
  ;;;###autoload
  (defun ob-async-org-babel-execute-src-block (&optional arg info params)
    "Like org-babel-execute-src-block, but run asynchronously.

  Original docstring for org-babel-execute-src-block:

  Execute the current source code block.  Insert the results of
  execution into the buffer.  Source code execution and the
  collection and formatting of results can be controlled through a
  variety of header arguments.

  With prefix argument ARG, force re-execution even if an existing
  result cached in the buffer would otherwise have been returned.

  Optionally supply a value for INFO in the form returned by
  `org-babel-get-src-block-info'.

  Optionally supply a value for PARAMS which will be merged with
  the header arguments specified at the front of the source code
  block."
    (interactive "P")
    (when (and (org-in-src-block-p)
               (assoc :async (nth 2 (org-babel-get-src-block-info))))
      (let ((placeholder (ob-async--generate-uuid)))
	(org-babel-insert-result placeholder '("replace"))
	;; This is the original source of org-babel-execute-src-block
	(let* ((org-babel-current-src-block-location
	      (or org-babel-current-src-block-location
		  (nth 5 info)
		  (org-babel-where-is-src-block-head)))
	     (info (if info (copy-tree info) (org-babel-get-src-block-info))))
	;; Merge PARAMS with INFO before considering source block
	;; evaluation since both could disagree.
	(cl-callf org-babel-merge-params (nth 2 info) params)
	(when (org-babel-check-evaluate info)
	  (cl-callf org-babel-process-params (nth 2 info))
	  (let* ((params (nth 2 info))
		 (cache (let ((c (cdr (assq :cache params))))
			  (and (not arg) c (string= "yes" c))))
		 (new-hash (and cache (org-babel-sha1-hash info)))
		 (old-hash (and cache (org-babel-current-result-hash)))
		 (current-cache (and new-hash (equal new-hash old-hash))))
	    (cond
	     (current-cache
	      (save-excursion		;Return cached result.
		(goto-char (org-babel-where-is-src-block-result nil info))
		(forward-line)
		(skip-chars-forward " \t")
		(let ((result (org-babel-read-result)))
		  (message (replace-regexp-in-string "%" "%%" (format "%S" result)))
		  result)))
	     ((org-babel-confirm-evaluate info)
	      (let* ((lang (nth 0 info))
		     (result-params (cdr (assq :result-params params)))
		     ;; Expand noweb references in BODY and remove any
		     ;; coderef.
		     (body
		      (let ((coderef (nth 6 info))
			    (expand
			     (if (org-babel-noweb-p params :eval)
				 (org-babel-expand-noweb-references info)
			       (nth 1 info))))
			(if (not coderef) expand
			  (replace-regexp-in-string
			   (org-src-coderef-regexp coderef) "" expand nil nil 1))))
		     (dir (cdr (assq :dir params)))
		     (default-directory
		       (or (and dir (file-name-as-directory (expand-file-name dir)))
			   default-directory))
		     (cmd (intern (concat "org-babel-execute:" lang)))
		     result)
		(unless (fboundp cmd)
		  (error "No org-babel-execute function for %s!" lang))
		(message "executing %s code block%s..."
			 (capitalize lang)
			 (let ((name (nth 4 info)))
			   (if name (format " (%s)" name) "")))
		  (progn
                    (async-start
                     `(lambda ()
			;; TODO: Put this in a function so it can be overidden
			;; Initialize the new Emacs process with org-babel functions
			(setq exec-path ',exec-path)
			(package-initialize)
			(org-babel-do-load-languages 'org-babel-load-languages ',org-babel-load-languages)
			(,cmd ,body ',params))
                     (if (member "none" ',result-params)
			 (progn (message "result silenced")
				'ignore)
                       `(lambda (result)
			  (switch-to-buffer ,(current-buffer))
			  (point-to-register 13) ;; TODO: totally arbitrary choice of register
			  (goto-char (point-min))
			  (re-search-forward ,placeholder)
			  (org-babel-previous-src-block)
			  (let ((file (cdr (assq :file ',params))))
                            ;; If non-empty result and :file then write to :file.
                            (when file
                              (when result
				(with-temp-file file
				  (insert (org-babel-format-result
					   result (cdr (assq :sep ',params))))))
                              (setq result file))
                            ;; Possibly perform post process provided its
                            ;; appropriate.  Dynamically bind "*this*" to the
                            ;; actual results of the block.
                            (let ((post (cdr (assq :post ',params))))
                              (when post
				(let ((*this* (if (not file) result
						(org-babel-result-to-file
						 file
						 (let ((desc (assq :file-desc ',params)))
						   (and desc (or (cdr desc) result)))))))
				  (setq result (org-babel-ref-resolve post))
				  (when file
                                    (setq result-params (remove "file" ',result-params))))))
                            (org-babel-insert-result result ',result-params ',info ',new-hash ',lang)
                            (run-hooks 'org-babel-after-execute-hook))
                            (goto-char (point-min))
                            (jump-to-register 13))))))))))))))
#+END_SRC

Our UUID is just a random MD5 hash, which is 32 characters.

#+BEGIN_SRC emacs-lisp
  (defun ob-async--generate-uuid ()
    "Generate a 32 character UUID."
    (md5 (number-to-string (random 100000000))))
#+END_SRC

#+RESULTS:
: generate-uuid

** Test Harness

#+BEGIN_SRC emacs-lisp :tangle test/test-helper.el
  (org-babel-do-load-languages 'org-babel-load-languages '((emacs-lisp . t) (shell . t) (python . t)))
  (setq org-confirm-babel-evaluate nil)
  (message "org-version: %s" (org-version))
  (add-to-list 'org-ctrl-c-ctrl-c-hook 'ob-async-org-babel-execute-src-block)
#+END_SRC

* CI
:PROPERTIES:
:header-args: :tangle .travis.yml
:END:

Every commit is tested on Travis CI. Rather than build Emacs from
source every time, we use prebuilt binaries for Emacs 24.5+ from
[[https://github.com/npostavs/emacs-travis/][npostavs' emacs-travis repository.]]

We test against =org-plus-contrib= from the official org archive and
we take =async= from elpa.

#+BEGIN_SRC yaml :exports results
  language: generic
  sudo: false
  git:
    submodules: false

  env:
    - EMACS_VERSION=24.5
    - EMACS_VERSION=25-prerelease

  install:
    - curl -LO https://github.com/npostavs/emacs-travis/releases/download/bins/emacs-bin-${EMACS_VERSION}.tar.gz
    - tar -xaf emacs-bin-${EMACS_VERSION}.tar.gz -C /
    # Configure $PATH: Emacs installed to /tmp/emacs
    - export PATH=/tmp/emacs/bin:${PATH}
    - if ! emacs -Q --batch --eval "(require 'cl-lib)" ; then
          curl -Lo cl-lib.el http://elpa.gnu.org/packages/cl-lib-0.5.el ;
          export warnings="'(not cl-functions)" ;
      fi
    - if ! emacs -Q --batch --eval "(require 'ert)" ; then
          curl -LO https://raw.githubusercontent.com/ohler/ert/c619b56c5bc6a866e33787489545b87d79973205/lisp/emacs-lisp/ert.el &&
          curl -LO https://raw.githubusercontent.com/ohler/ert/c619b56c5bc6a866e33787489545b87d79973205/lisp/emacs-lisp/ert-x.el ;
      fi
    - emacs --version
    # Install Cask
    - mkdir "$HOME"/bin # Cask is installed here
    - wget 'https://raw.githubusercontent.com/flycheck/emacs-travis/master/emacs-travis.mk'
    - make -f emacs-travis.mk install_cask
    # Use Cask to install dependencies
    - make install-dev

  script:
    - make test

  notifications:
    email:
      # Default is change, but that includes a new branch's 1st success.
      on_success: never
      on_failure: always # The default.
#+END_SRC

* Footer
:PROPERTIES:
:header-args: :tangle ob-async.el
:END:

#+BEGIN_SRC emacs-lisp :tangle ob-async.el
  ;;; ob-async.el ends here
#+END_SRC
